MinorCSE/Re700_kOmega/system/sampleDict_wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat raw;

interpolationScheme cellPatchConstrained;

type surfaces;

libs ("libsampling.so");


fields
(
    //U
    //epsilon
    //k
    wallShearStress
    //yPlus
    //p
    //wallGradU
    //tensorLimitStates
    //RAnisoEigenValues
);

/*
sets
(

  profile_crest
  {
      type        midPoint;
      axis        y;
      //nPoints 100;
      start       (0.0  1.0  0);
      end         (0.0  3.035  0);
  }
);
*/


surfaces
(
  bottomWall
  {
      type            patch;
      //patches         ( ".bottomWall.*" );
      patches         ( "bottomWall" );
      interpolate     true;
      // Optional: whether to leave as faces (=default) or triangulate
      // triangulate     false;
  }
);


// *********************************************************************** //
